{
  "name": "Bricks Form - Ecomail Integration",
  "slug": "integrate-ecomail-bricks",
  "author": "<a href='https://webypolopate.cz'>Adam Kotala</a>",
  "author_profile": "https://webypolopate.cz",
  "version": "1.1.0",
  "requires": "5.6",
  "tested": "6.5",
  "requires_php": "7.4",
  "sections": {
    "description": "Tento plugin integruje Bricks Form s Ecomail API, což umožňuje odesílat data z formulářů přímo do Ecomail. Obsahuje také licenční funkcionalitu prostřednictvím SureCart pro správu a ochranu používání pluginu.",
    "changelog": "<h4>1.1.0 - 2025-03-02</h4><ul><li>Přidána podpora pro tagy - nyní můžete přiřadit tagy kontaktům při přihlášení</li><li>Opraveno zpracování polí formuláře - nyní jsou všechna pole správně odesílána do Ecomail</li><li>Upraveno mapování polí pro kompatibilitu s Ecomail API (firstname → name, lastname → surname)</li><li>Vylepšeno mapování polí formuláře pro lepší kompatibilitu s různými verzemi Bricks</li><li>Přidána podpora pro vlastní pole</li><li>Přidán debug mód pro snadnější řešení problémů</li><li>Přidána cache pro seznamy kontaktů pro zlepšení výkonu</li><li>Vylepšena dokumentace a uživatelské rozhraní</li><li>Upozornění o licenci se nyní zobrazuje pouze na stránkách nastavení pluginu</li></ul><h4>1.0.0 - 2025-02-15</h4><ul><li>Počáteční vydání s integrací pro Bricks Form, Ecomail API a licencování SureCart</li></ul>",
    "frequently asked questions": "<h4>Jak nakonfiguruji plugin?</h4><p>Zadejte svůj Ecomail API klíč v nastavení pluginu a aktivujte licenci prostřednictvím stránky Nastavení licence v administraci WordPressu. Pro další pomoc se podívejte do dokumentace.</p><h4>Jak získám API klíč?</h4><p>API klíč najdete ve svém účtu Ecomail v sekci Nastavení > API.</p><h4>Jaká pole mohu mapovat?</h4><p>Můžete mapovat standardní pole jako email, jméno, příjmení, telefon, město a zemi. Navíc můžete přidat libovolná vlastní pole, která máte definována ve svém Ecomail účtu.</p><h4>Jak přidám tagy ke kontaktům?</h4><p>V nastavení formuláře v sekci \"Tagy\" zadejte každý tag na nový řádek. Tagy budou automaticky přiřazeny kontaktu při přihlášení.</p><h4>Proč se některá pole neodesílají do Ecomail?</h4><p>Zkontrolujte, zda jsou pole správně namapována. Zapněte debug mód v nastavení formuláře pro podrobné logování a zjištění problému.</p><h4>Proč se seznamy načítají pomalu?</h4><p>Seznamy jsou nyní ukládány do cache na 1 hodinu, což by mělo výrazně zrychlit načítání. Pokud potřebujete aktualizovat seznamy, použijte tlačítko \"Vymazat cache seznamů\" v nastavení pluginu.</p>"
  }
}